fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_ОтпускаСотрудников</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДлительностьОтпускаБольше28</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ОтпускаСотрудников/ВКМ_ОтпускаСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ОтпускаСотрудников</name>
  <resources>
    <name>КоличествоДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаНачалаПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОкончанияПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаНачалаФакт</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОкончанияФакт</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ОбработчикиСобытий
	Процедура ОбработкаПроведения(Отказ, Режим)
		
		ЧислоСекундВСутках = 86400;
		// регистр ВКМ_ОтпускаСотрудников Приход
		Движения.ВКМ_ОтпускаСотрудников.Записывать = Истина;
		Для Каждого ТекСтрокаОтпускаСотрудников Из ОтпускаСотрудников Цикл
			Движение = Движения.ВКМ_ОтпускаСотрудников.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Сотрудник = ТекСтрокаОтпускаСотрудников.Сотрудник;
			Движение.Год = Год;
			Движение.ДатаНачалаПлан = ТекСтрокаОтпускаСотрудников.ДатаНачала;
			Движение.ДатаОкончанияПлан = ТекСтрокаОтпускаСотрудников.ДатаОкончания;
			Движение.КоличествоДней = (ТекСтрокаОтпускаСотрудников.ДатаОкончания - ТекСтрокаОтпускаСотрудников.ДатаНачала +ЧислоСекундВСутках)/ЧислоСекундВСутках;
		КонецЦикла;
		
	КонецПроцедуры
	#КонецОбласти
	
#КонецЕсли
